================================================================================
Integers
================================================================================

1
120

--------------------------------------------------------------------------------

(source_file
 (expression
  (int))
 (expression
  (int)))

================================================================================
Floats
================================================================================

6.6
1.1
123.4123
123.123
1.3.1
1.
1e3.4
.3e14
10.
.1
123.4123E-10

--------------------------------------------------------------------------------

(source_file
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float)))

================================================================================
Numbers
================================================================================

1
2
3.5
4
1e+10

--------------------------------------------------------------------------------


(source_file
  (expression
    (int))
  (expression
    (int))
  (expression
    (float))
  (expression
    (int))
  (expression
    (float)))

================================================================================
Numeric
================================================================================

10cm
0.5in
360deg
1.5rad
1.4em
1fr
2e10pt
1.5mm
1.0510e-10%

--------------------------------------------------------------------------------

(source_file
  (expression
    (numeric
      (int)
      (unit)))
  (expression
    (numeric
      (float)
      (unit)))
  (expression
    (numeric
      (int)
      (unit)))
  (expression
    (numeric
      (float)
      (unit)))
  (expression
    (numeric
      (float)
      (unit)))
  (expression
    (numeric
      (int)
      (unit)))
  (expression
    (numeric
      (float)
      (unit)))
  (expression
    (numeric
      (float)
      (unit)))
  (expression
    (numeric
      (float)
      (unit))))

================================================================================
Scientific Notation Floats
================================================================================

1e322
1e-3
1e+3
1.8e10
1.e10
1e10

--------------------------------------------------------------------------------

(source_file
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float))
  (expression
    (float)))

================================================================================
Strings
================================================================================

"hello"
"hello world"

--------------------------------------------------------------------------------

(source_file
  (expression
    (string
      (string_content)))
  (expression
    (string
      (string_content))))

================================================================================
Escape Sequences
================================================================================

\~
"\#"
"\@"
"\t\r\n"
"\x12 \123 \u1234"

--------------------------------------------------------------------------------

(source_file
  (escape_sequence)
  (expression
    (string
      (string_content
        (escape_sequence))))
  (expression
    (string
      (string_content
        (escape_sequence))))
  (expression
    (string
      (string_content
        (escape_sequence)
        (escape_sequence)
        (escape_sequence))))
  (expression
    (string
      (string_content
        (escape_sequence)
        (escape_sequence)
        (escape_sequence)))))

================================================================================
Other Literals
================================================================================

true
false
none
auto

--------------------------------------------------------------------------------

(source_file
  (expression
    (boolean))
  (expression
    (boolean))
  (expression
    (none))
  (expression
    (auto)))

================================================================================
Concatenated Strings
================================================================================

"one" "two" "three"

--------------------------------------------------------------------------------

(source_file
  (expression
    (string
      (string_content)))
  (expression
    (string
      (string_content)))
  (expression
    (string
      (string_content))))
